<?php

namespace Guillaumetissier\QrCode\Tests\Encoder\ErrorCorrectionCalculator\GeneratorPolynomial;

use Guillaumetissier\GaloisFields\Polynomial\PolynomialFormatter;
use Guillaumetissier\QrCode\Tests\Logger\LoggerTestCase;
use Guillaumetissier\QrCode\Encoder\ErrorCorrectionCalculator\GeneratorPolynomial\GeneratorPolynomialFactory;
use Guillaumetissier\QrCode\Polynomial\Decorator\Gf256PolynomialDecorator;

class FactoryTest extends LoggerTestCase
{
    private GeneratorPolynomialFactory $factory;

    public function setUp(): void
    {
        parent::setUp();

        $this->factory = GeneratorPolynomialFactory::create($this->logger);
    }

    /**
     * @dataProvider provideDataToTestCreate
     */
    public function testCreate(int $numECCodewords, string $expectedPolynomial): void
    {
        $actualPolynomial = $this->factory->createGeneratorPolynomial($numECCodewords);

        $this->assertEquals($expectedPolynomial, PolynomialFormatter::toAlphaString($actualPolynomial));
    }

    public static function provideDataToTestCreate(): \Generator
    {
        yield [7, 'α^0x^7 + α^87x^6 + α^229x^5 + α^146x^4 + α^149x^3 + α^238x^2 + α^102x + α^21'];
        yield [10, 'α^0x^10 + α^251x^9 + α^67x^8 + α^46x^7 + α^61x^6 + α^118x^5 + α^70x^4 + α^64x^3 + α^94x^2 + α^32x + α^45'];
        yield [13, 'α^0x^13 + α^74x^12 + α^152x^11 + α^176x^10 + α^100x^9 + α^86x^8 + α^100x^7 + α^106x^6 + α^104x^5 + α^130x^4 + α^218x^3 + α^206x^2 + α^140x + α^78'];
        yield [15, 'α^0x^15 + α^8x^14 + α^183x^13 + α^61x^12 + α^91x^11 + α^202x^10 + α^37x^9 + α^51x^8 + α^58x^7 + α^58x^6 + α^237x^5 + α^140x^4 + α^124x^3 + α^5x^2 + α^99x + α^105'];
        yield [16, 'α^0x^16 + α^120x^15 + α^104x^14 + α^107x^13 + α^109x^12 + α^102x^11 + α^161x^10 + α^76x^9 + α^3x^8 + α^91x^7 + α^191x^6 + α^147x^5 + α^169x^4 + α^182x^3 + α^194x^2 + α^225x + α^120'];
        yield [17, 'α^0x^17 + α^43x^16 + α^139x^15 + α^206x^14 + α^78x^13 + α^43x^12 + α^239x^11 + α^123x^10 + α^206x^9 + α^214x^8 + α^147x^7 + α^24x^6 + α^99x^5 + α^150x^4 + α^39x^3 + α^243x^2 + α^163x + α^136'];
        yield [18, 'α^0x^18 + α^215x^17 + α^234x^16 + α^158x^15 + α^94x^14 + α^184x^13 + α^97x^12 + α^118x^11 + α^170x^10 + α^79x^9 + α^187x^8 + α^152x^7 + α^148x^6 + α^252x^5 + α^179x^4 + α^5x^3 + α^98x^2 + α^96x + α^153'];
        yield [20, 'α^0x^20 + α^17x^19 + α^60x^18 + α^79x^17 + α^50x^16 + α^61x^15 + α^163x^14 + α^26x^13 + α^187x^12 + α^202x^11 + α^180x^10 + α^221x^9 + α^225x^8 + α^83x^7 + α^239x^6 + α^156x^5 + α^164x^4 + α^212x^3 + α^212x^2 + α^188x + α^190'];
        yield [22, 'α^0x^22 + α^210x^21 + α^171x^20 + α^247x^19 + α^242x^18 + α^93x^17 + α^230x^16 + α^14x^15 + α^109x^14 + α^221x^13 + α^53x^12 + α^200x^11 + α^74x^10 + α^8x^9 + α^172x^8 + α^98x^7 + α^80x^6 + α^219x^5 + α^134x^4 + α^160x^3 + α^105x^2 + α^165x + α^231'];
        yield [24, 'α^0x^24 + α^229x^23 + α^121x^22 + α^135x^21 + α^48x^20 + α^211x^19 + α^117x^18 + α^251x^17 + α^126x^16 + α^159x^15 + α^180x^14 + α^169x^13 + α^152x^12 + α^192x^11 + α^226x^10 + α^228x^9 + α^218x^8 + α^111x^7 + α^0x^6 + α^117x^5 + α^232x^4 + α^87x^3 + α^96x^2 + α^227x + α^21'];
        yield [26, 'α^0x^26 + α^173x^25 + α^125x^24 + α^158x^23 + α^2x^22 + α^103x^21 + α^182x^20 + α^118x^19 + α^17x^18 + α^145x^17 + α^201x^16 + α^111x^15 + α^28x^14 + α^165x^13 + α^53x^12 + α^161x^11 + α^21x^10 + α^245x^9 + α^142x^8 + α^13x^7 + α^102x^6 + α^48x^5 + α^227x^4 + α^153x^3 + α^145x^2 + α^218x + α^70'];
        yield [28, 'α^0x^28 + α^168x^27 + α^223x^26 + α^200x^25 + α^104x^24 + α^224x^23 + α^234x^22 + α^108x^21 + α^180x^20 + α^110x^19 + α^190x^18 + α^195x^17 + α^147x^16 + α^205x^15 + α^27x^14 + α^232x^13 + α^201x^12 + α^21x^11 + α^43x^10 + α^245x^9 + α^87x^8 + α^42x^7 + α^195x^6 + α^212x^5 + α^119x^4 + α^242x^3 + α^37x^2 + α^9x + α^123'];
        yield [30, 'α^0x^30 + α^41x^29 + α^173x^28 + α^145x^27 + α^152x^26 + α^216x^25 + α^31x^24 + α^179x^23 + α^182x^22 + α^50x^21 + α^48x^20 + α^110x^19 + α^86x^18 + α^239x^17 + α^96x^16 + α^222x^15 + α^125x^14 + α^42x^13 + α^173x^12 + α^226x^11 + α^193x^10 + α^224x^9 + α^130x^8 + α^156x^7 + α^37x^6 + α^251x^5 + α^216x^4 + α^238x^3 + α^40x^2 + α^192x + α^180'];
        yield [32, 'α^0x^32 + α^10x^31 + α^6x^30 + α^106x^29 + α^190x^28 + α^249x^27 + α^167x^26 + α^4x^25 + α^67x^24 + α^209x^23 + α^138x^22 + α^138x^21 + α^32x^20 + α^242x^19 + α^123x^18 + α^89x^17 + α^27x^16 + α^120x^15 + α^185x^14 + α^80x^13 + α^156x^12 + α^38x^11 + α^69x^10 + α^171x^9 + α^60x^8 + α^28x^7 + α^222x^6 + α^80x^5 + α^52x^4 + α^254x^3 + α^185x^2 + α^220x + α^241'];
        yield [34, 'α^0x^34 + α^111x^33 + α^77x^32 + α^146x^31 + α^94x^30 + α^26x^29 + α^21x^28 + α^108x^27 + α^19x^26 + α^105x^25 + α^94x^24 + α^113x^23 + α^193x^22 + α^86x^21 + α^140x^20 + α^163x^19 + α^125x^18 + α^58x^17 + α^158x^16 + α^229x^15 + α^239x^14 + α^218x^13 + α^103x^12 + α^56x^11 + α^70x^10 + α^114x^9 + α^61x^8 + α^183x^7 + α^129x^6 + α^167x^5 + α^13x^4 + α^98x^3 + α^62x^2 + α^129x + α^51'];
        yield [36, 'α^0x^36 + α^200x^35 + α^183x^34 + α^98x^33 + α^16x^32 + α^172x^31 + α^31x^30 + α^246x^29 + α^234x^28 + α^60x^27 + α^152x^26 + α^115x^25 + α^0x^24 + α^167x^23 + α^152x^22 + α^113x^21 + α^248x^20 + α^238x^19 + α^107x^18 + α^18x^17 + α^63x^16 + α^218x^15 + α^37x^14 + α^87x^13 + α^210x^12 + α^105x^11 + α^177x^10 + α^120x^9 + α^74x^8 + α^121x^7 + α^196x^6 + α^117x^5 + α^251x^4 + α^113x^3 + α^233x^2 + α^30x + α^120'];
        yield [40, 'α^0x^40 + α^59x^39 + α^116x^38 + α^79x^37 + α^161x^36 + α^252x^35 + α^98x^34 + α^128x^33 + α^205x^32 + α^128x^31 + α^161x^30 + α^247x^29 + α^57x^28 + α^163x^27 + α^56x^26 + α^235x^25 + α^106x^24 + α^53x^23 + α^26x^22 + α^187x^21 + α^174x^20 + α^226x^19 + α^104x^18 + α^170x^17 + α^7x^16 + α^175x^15 + α^35x^14 + α^181x^13 + α^114x^12 + α^88x^11 + α^41x^10 + α^47x^9 + α^163x^8 + α^125x^7 + α^134x^6 + α^72x^5 + α^20x^4 + α^232x^3 + α^53x^2 + α^35x + α^15'];
        yield [68, 'α^0x^68 + α^247x^67 + α^159x^66 + α^223x^65 + α^33x^64 + α^224x^63 + α^93x^62 + α^77x^61 + α^70x^60 + α^90x^59 + α^160x^58 + α^32x^57 + α^254x^56 + α^43x^55 + α^150x^54 + α^84x^53 + α^101x^52 + α^190x^51 + α^205x^50 + α^133x^49 + α^52x^48 + α^60x^47 + α^202x^46 + α^165x^45 + α^220x^44 + α^203x^43 + α^151x^42 + α^93x^41 + α^84x^40 + α^15x^39 + α^84x^38 + α^253x^37 + α^173x^36 + α^160x^35 + α^89x^34 + α^227x^33 + α^52x^32 + α^199x^31 + α^97x^30 + α^95x^29 + α^231x^28 + α^52x^27 + α^177x^26 + α^41x^25 + α^125x^24 + α^137x^23 + α^241x^22 + α^166x^21 + α^225x^20 + α^118x^19 + α^2x^18 + α^54x^17 + α^32x^16 + α^82x^15 + α^215x^14 + α^175x^13 + α^198x^12 + α^43x^11 + α^238x^10 + α^235x^9 + α^27x^8 + α^101x^7 + α^184x^6 + α^127x^5 + α^3x^4 + α^5x^3 + α^8x^2 + α^163x + α^238'];
    }
}
